// 변수 : 선언, 초기화, 재할당

// 변수 선언 방법

// const : 변하지 않는 데이터값 선언, 재할당 불가
const 변수1 = '코딩';

// let : 변하는 데이터값 선언, 재할당 가능
let 변수2 = '자바스크립트';

// ==============================================

// 데이터 타입, 자료형

// 1. string : 문자열

// 2. number : 숫자

// 3. bigInt : 큰 값이 숫자

// 4. boolean : true, false

// 5. symbol : 중복되지 않는 고유값

// 6,7. null / undefined

// null은 값이 의도적으로 비어있음을 뜻하고, undefined는 아직 값이 할당이 안됨을 의미

// 8. object : 객체 - 함수, 배열, 객체

// =============================================

// 1. 산술 연산자 : +, -, /, *, %, **, +=, -=

// 2. 할당 연산자 : =

// 3. 문자열 연산자 : +, +=

let data = 'happy' + '2022';

// 4. 비교 연산자 :

// 1) ==, != : 대충 비교
// 2) ===, !== : 엄격히 비교 (자료형까지 비교)
// 3) >, >=, <, <==

// 5. 논리 연산자 : &&, ||, !

// && : 조건 중 하나라도 false가 되면 => false
// || : 두개의 조건이 모두 false여야지 => false
// ! : 반대


